/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_isascii.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: mgwyness <mgwyness@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2021/10/08 15:54:19 by mgwyness          #+#    #+#             */
/*   Updated: 2021/10/08 21:14:16 by mgwyness         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"
// Значения печатных символов находятся в пределах от 0x20 до 0х7Е
int ft_isascii(int c)
{
    if (c >= 0 && c <= 127) 
        return (1);
    else
        return (0);
}

// int main(void)
// {
//     printf ("%d\n", ft_isascii(31));
//     printf ("%d\n", isascii(31));
//     return (0);
// }